abhav1947/stm32f302r8t6_nucleo64_drivers/stm32f302r8x_gpio_driver.h
/*
 * stm32f302r8x_gpio_driver.h
 *
 *  Created on: 07-Aug-2021
 *      Author: Abhav S Velidi
 */

#ifndef INC_STM32F302R8X_GPIO_DRIVER_H_
#define INC_STM32F302R8X_GPIO_DRIVER_H_

#include"stm32f302r8.h"

/*Configuration structure of gpio pin*/

typedef struct
{
	uint8_t GPIO_PinNumber;  //Pin Number
	uint8_t GPIO_PinMode;  //MODE
	uint8_t GPIO_PinSpeed;  //speed
	uint8_t GPIO_PinPuPdControl; // pup resistor
	uint8_t GPIO_PinOPType;  //op type
	uint8_t GPIO_PinAltFunMode;
}GPIO_PinConfig_t;

/* Handle structure for GPIO pin*/

typedef struct
{
	/* Pointer to hold base address of gpio peripheral*/
	GPIO_RegDef_t *pGPIOX;   /*Holds Base address of GPIO port*/
	GPIO_PinConfig_t GPIO_PinConfig;  /*Hold Pin configuration setting*/
}GPIO_Handel_t;


//Pin Number
#define GPIO_PIN_NO_0 			0
#define GPIO_PIN_NO_1 			1
#define GPIO_PIN_NO_2 			2
#define GPIO_PIN_NO_3 			3
#define GPIO_PIN_NO_4 			4
#define GPIO_PIN_NO_5 			5
#define GPIO_PIN_NO_6 			6
#define GPIO_PIN_NO_7 			7
#define GPIO_PIN_NO_8 			8
#define GPIO_PIN_NO_9 			9
#define GPIO_PIN_NO_10 			10
#define GPIO_PIN_NO_11 			11
#define GPIO_PIN_NO_12 			12
#define GPIO_PIN_NO_13 			13
#define GPIO_PIN_NO_14 			14
#define GPIO_PIN_NO_15 			15

//MODE
#define GPIO_MODE_IN			0
#define GPIO_MODE_OUT			1
#define GPIO_MODE_ALTFN			2
#define GPIO_MODE_ANALOG		3
#define GPIO_MODE_IT_FT         4
#define GPIO_MODE_IT_RT         5
#define GPIO_MODE_IT_RFT        6

//op type
#define GPIO_OP_TYPE_PP         0
#define GPIO_OP_TYPE_OD			1

//speed
#define GPIO_SPEED_LOW          0
#define GPIO_SPEED_MEDIUM       1
#define GPIO_SPEED_HIGH         3

// pup resistor
#define GPIO_NO_PUPD			0
#define GPIO_PIN_PU				1
#define GPIO_PIN_PD				2


/***************************************************************************************************************************
 *                                                      API supported by this driver
 **************************************************************************************************************************/
/* Peripheral Clock Setup*/
void GPIO_PeriClockControl(GPIO_RegDef_t *pGPIOx, uint8_t EnorDi); /*GPIO Clock control*/

/*Init Deinit*/
void GPIO_Init(GPIO_Handel_t *pGPIOHandle); /*GPIO Initialization of port or pin*/

void GPIO_DeInit(GPIO_RegDef_t *pGPIOx); /*GPIO De initialization/reset of register*/

/*Data Read Write*/
uint8_t GPIO_ReadFromInputpin(GPIO_RegDef_t *pGPIOx, uint8_t PinNumber); /*Read from GPIO Pin*/
uint16_t GPIO_ReadFromInputport(GPIO_RegDef_t *pGPIOx); /*Read From GPIO Port*/
void GPIO_WriteToOutputPin(GPIO_RegDef_t *pGPIOx, uint8_t PinNumber, uint8_t Value); /*Write into GPIO Pin */
void GPIO_WriteToOutputPort(GPIO_RegDef_t *pGPIOx, uint16_t Value); /*Write into GPIO Port */
void GPIO_ToggleOutputPin(GPIO_RegDef_t *pGPIOx, uint8_t PinNumber); /*GPIO output toggle*/

/*Interrupt handler*/
void GPIO_IRQInterruptConfig(uint8_t IRQNumber , uint8_t EnorDi);
void GPIO_IRQPriorityConfig(uint8_t IRQNumber,uint8_t IRQPriority);
void GPIO_IRQHandling(uint8_t PinNumber);





#endif /* INC_STM32F302R8X_GPIO_DRIVER_H_ */




































